//=========================================
// 
// 背景のヘッダーファイル
// Author YudaKaito
// 
//=========================================
#ifndef _AG_H_
#define _AG_H_

//-----------------------------------------
// include
//-----------------------------------------
#define NUM_AG	(2)	// 背景の数

//-----------------------------------------
// グラデーションの列挙型
//-----------------------------------------
typedef enum
{
	AGRADATION_TOP = 0,
	AGRADATION_BOT,
	AGRADATION_MAX,
}GRADATIONAG;

//-----------------------------------------
// プロトタイプ宣言
//-----------------------------------------
void InitAG(void);
void UninitAG(void);
void UpdateAG(void);
void DrawAG(void);

#endif // !_AG_H_
