//=========================================
//
//背景のヘッダーファイル
//Author YudaKaito
//
//=========================================
#ifndef _BG_H_
#define _BG_H_

//-----------------------------------------
//include
//-----------------------------------------
#define NUM_BG	(2)	//背景の数

//-----------------------------------------
//グラデーションの列挙型
//-----------------------------------------
typedef enum
{
	GRADATION_TOP = 0,
	GRADATION_BOT,
	GRADATION_MAX,
}GRADATION;

//-----------------------------------------
//プロトタイプ宣言
//-----------------------------------------
void InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

#endif // !_BG_H_
