//=========================================
// 
// 敵のヘッダーファイル
// Author YudaKaito
// 
//=========================================
#ifndef _TIME_H_
#define	_TIME_H_

//------------------------------------
// include
//------------------------------------
#include "player.h"

//------------------------------------
// マクロ定義
//------------------------------------
#include "main.h"

//------------------------------------
// プロトタイプ宣言
//------------------------------------
void InitTime(void);							// 初期化処理
void UninitTime(void);							// 終了処理
void UpdateTime(void);							// 更新処理
void DrawTime(void);							// 描画処理
void SetEnemy(D3DXVECTOR3 pos);	// 設定処理

#endif // !_TIME_H_
